<template>
  <div class="agree">
    <div class="header border-1px">
      <span class="close iconfont icon-zuo" @click="back()"></span>
      <span class="title border-1px">VIP会员服务协议</span>
    </div>
    <div class="container">
      <div class="content">
        <h3>版本生效日期：2019年 10 月 18 日</h3>尊敬的用户：欢迎您使用大麦网收费服务。大麦网提供的网络服务采用收费与免费结合的方式。您须先成为大麦网普通注册用户之后，才能继续进行收费服务的购买服务。通过购买程序支付费用后，您就可以轻松享受大麦网VIP会员服务。在开始购买程序之前，请您首先同意并接受以下服务协议条款。
        【注意】大麦网提醒您，请仔细阅读以下全部内容，特别以黑体加粗或其他合理方式提示您注意，并请您重点阅读的条款。未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为已获得法定监护人的认可。如果您不同意本协议的任一或全部条款内容，请不要以确认的形式（包括但不限于：点击、进入购买程序等）进行下一步操作或使用本协议项下服务。当您确认接受本协议或开始使用本协议项下大麦网服务时，即表示您与大麦网（平台运营主体：北京红马传媒文化发展有限公司，以下简称“大麦网”或“服务主体”】已达成协议关系，并自愿接受并遵守大麦网提供服务涉及的包括本协议在内的所有服务规范及相关子协议、管理规范，包括但不限于大麦网不时发布并修订的关于大麦网会员服务协议、大麦网订票服务条款、大麦网VIP会员服务协议、活动规则、使用规则、公告、提示、通知及在线FAQ等内容。
        大麦网有权就本协议及相关子协议、管理规范、权益说明进行更新，更新会通过在首页显著位置公开内容或者信息链接标识的方式通知和提醒您注意，更新后依法生效。您的权利以及义务的表述、服务内容及收费标准，均以最新的服务协议为准。如您继续使用服务，即意味着您同意接受我方更新后的服务协议。如您不同意变更后的服务协议，请您停止使用本产品和服务。
        一、如何成为大麦网VIP会员：
        （一）会员开通
        1、您可通过各种已有和未来新增的支付渠道或大麦网指定的方式成为大麦网VIP会员。当您根据页面提示确认愿意并成功支付了会员服务费和/或完成了成为大麦网VIP会员的所有程序，且通过大麦网审核后，即可享受本VIP会员服务。
        2、您可以通过登录大麦网VIP会员中心免费查询您的账号信息详情，包括已开通的服务内容、服务期限。
        请您特别注意：
        如您选择订购联合会员产品，大麦网仅就大麦网VIP会员产品负责，不对第三方产品负责。第三方产品的权益、使用、收费规则等问题由第三方负责执行和解释。
        大麦网VIP会员服务可在大麦网移动客户端（即大麦APP）、大麦网PC端（www.damai.cn）、大麦网M站（m.damai.cn）、大麦网微信小程序和大麦网支付宝小程序使用。
        （二）帐号管理及使用
        1、您充分了解并同意，您须为自己登录帐号下的行为负责，包括但不限于您所发表的任何内容以及由此产生的后果。您应对本服务提供的内容自行加以判断，并承担因使用内容而引起的风险。
        2、大麦网账号及密码与您的会员权益及资格密切相关，因此请您务必正确使用及妥善保管、维护您的大麦网帐号及密码，如发生泄漏、遗失、被盗等行为，而该等行为并非大麦网法定过错导致，损失将由您自行承担。
        3、您在此授予大麦网保护您帐号安全的相关权利，大麦网可定期或不定期采用不同的方式对您帐号的使用安全进行检查、验证，包括但不限于主动联系您进行身份验证、短消息验证、邮箱认证等。如您无法完成验证或无正当理由拒绝验证的，大麦网可合理怀疑您的帐号出现异常或被盗，因而中止向该帐号提供服务或采取进一步措施。
        4、 帐号合法获取及使用
        （1）任何使用非法手段或通过任何非大麦网官方或授权途径获取票品、优惠券、会员资格、会员权益以及参加活动获取福利（包括但不限于获得实体/虚拟礼品等）的行为（如：使用机器人软件、蜘蛛软件、爬虫软件或人工众包方式进行批量注册、刷单、虚假交易；恶意利用、破坏大麦网会员活动规则等），均不获相关保护。大麦网有权在发生前述情形时，取消及/或不予提供相关商品和服务，已经缴纳的费用不退，且所有产生的损失及责任由行为人自行承担，大麦网保留追究行为人法律责任的权利。
        大麦网在此声明：除经大麦网合法授权的代理商外，大麦网从未授权其他任何第三方销售、转让大麦网VIP会员资格。任何未经大麦网明示授权而销售、转让大麦网VIP会员资格的行为属于非法销售、非法转让，大麦网有权追究其法律责任。
        （2）您参加会员活动时，应按照活动规则、以合法且不损害活动举办方利益的方式进行，利用系统漏洞、规则设置缺陷、系统设置错误、滥用会员身份等参加活动并获取相关福利的，均不受保护，且一经发现大麦网有权立即就相关服务做出删除、取消、清零等处理，并有权取消及/或不予提供VIP会员服务，已经缴纳的费用不退，且所有产生的损失及责任由行为人自行承担，大麦网保留追究行为人法律责任的权利。
        （3）大麦网VIP会员服务，是在您遵守本协议及相关法律法规的前提下，大麦网给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的使用，并仅可用作个人购票使用。未经过合法授权，不可以营利、经营等非个人使用的目的为自己或他人（申请）开通或使用（无论您是否向他人收取费用）。 在此，您理解并同意，您不得有以下行为：
        1）将享有大麦网VIP会员服务帐号以任何方式提供给他人使用，包括但不限于不得以转让、出租、借用、分享、出售等方式提供给他人为任何目的使用（无论有偿或无偿）；
        2）通过非法手段对大麦网VIP会员账户的服务期限、消费金额、交易状态进行修改，或用非法的方式或为了非法的目的使用已购买的VIP会员订票服务；
        3）其他非个人使用行为。
        若您违反以上约定，因此产生法律后果及责任均由您自行承担，且大麦网有权不经通知拒绝申请或中止或终止对您提供服务，并不退还VIP会员服务费或支付其他形式的赔偿，同时大麦网有权追究您相关的法律责任。
        5、帐号独立
        VIP会员服务仅限于申请账号自行使用；每个帐号之间的充值记录、订票数据无法进行转移、迁徙、转让、赠与、售卖、租借、分享，无论该等帐号是否由同一使用人拥有，请您在登录及/或充值及/或参加活动时注意区分，避免造成损失。且大麦网有权在未经通知的情况下取消转让账号、受让账号的VIP会员服务资格，由此带来的损失由VIP会员自行承担。
        6、权利归属
        您理解并同意：您拥有合法获得的大麦网VIP会员帐号下大麦网VIP会员服务和产品的使用权，上述服务和产品及其衍生物的所有权及知识产权均归大麦网所有（但是经合法渠道取得的实体产品所有权或大麦网另有公告说明的除外）。
        7、登录限制
        您理解并同意：为保护您的会员账户安全，避免共享密码或泄漏被盗，大麦网VIP会员帐号仅限您个人使用，不允许转借或租赁他人。
        如您超过上述范围使用VIP会员权益，大麦网将会根据情况中止或终止对您的服务，造成的损失将由您自行承担，且大麦网保留采取进一步措施的权利。
        8、账号注销
        除大麦网按照协议或公告及相关法律法规注销用户的会员账号外，您可以通过联系大麦网客服或通过其他大麦网公示的方式注销会员账号。账号一旦注销，您将无法继续使用大麦网VIP会员服务。且您曾通过该账号使用的大麦网或/及其关联公司的产品与服务下的所有内容、信息、数据、记录将会被删除或匿名化处理；除法律法规另有规定，您也无法再检索、访问、获取、继续使用和找回，也无权要求大麦网找回。
        二. 大麦网VIP会员权益及服务期限、收费标准
        （一）权益内容
        1、大麦网VIP会员权益，即大麦网为VIP会员提供专享优惠及增值服务，包括但不限于会员专享标识、全场通用组合优惠券包、各类品牌优惠券等，具体以相关服务页面公布、实际提供的内容为准。
        2、大麦网VIP会员服务分为不同等级，不同会员等级之间的会员权益存在差异，且根据相关规则，将会有会员等级的晋升步骤，晋升后您将会享有更多的服务体验，具体以相关服务页面公布、实际提供的内容为准。
        3、大麦网VIP会员可享受的全部权益以大麦网官方渠道公布的会员权益为准。大麦网有权基于大麦网自身业务发展需要变更全部或部分会员权益。就前述权益调整大麦网将在相应服务页面进行通知或公告，并在公告后依法生效。您也可通过大麦网官方网站或官方移动客户端查询最新的会员权益内容。同时大麦网也鼓励您定期查看本协议内容，以更好地保障您的权益。
        4、您通过大麦网指定渠道开通本服务后，可能会由于您使用的软件版本、设备、操作系统等的不同以及其他第三方原因导致您实际可使用的具体服务有一定差别。
        5、请您理解并同意，大麦网可以通过电子邮件、站内信息、手机短信、微信、网站公告或其他方式向您发送促销信息、内容推荐或其他相关商业信息。
        （二） 服务期限
        1、大麦网VIP会员服务的服务期限以会员自行选择并支付相应会员费用的期限为准。具体期限您也可以登陆本服务的相应页面查询。除非大麦网另外通知，否则上述大麦网服务的有效期按自然天数计算。VIP会员服务的服务期限到期后，大麦网将停止继续向您提供VIP会员服务。
        2、本服务的服务期间，包含大麦网解决故障、服务器维修、调整、升级、因第三方侵权处理等所需的合理时间，大麦网对上述情况所需用的时间不另行补偿。
        （三） 收费标准
        1、本服务是大麦网提供的收费服务，您须在按照本服务的收费标准支付相应费用后，方可使用本服务。
        2、大麦网可能会根据本服务的整体规划，对本服务相关权益细则、收费标准、方式等进行修改和变更，并可能根据实际状况，对不同身份、不同阶段续费的VIP会员给予不同的增值服务或资费政策，具体收费标准以大麦网在相关服务页面公示的信息为准。您同意您继续操作的行为（包括但不限于点击同意、支付行为、继续使用会员服务的行为等），即视为您知悉并同意该收费标准。
        3、您成为大麦网VIP会员后，有权利选择不继续接受大麦网VIP会员服务，您可申请取消VIP会员服务，但此取消行为将无法获得已交纳的VIP会员服务费的退还或其他形式的补偿/赔偿（因大麦网原因导致的取消除外）。
        （四） 费用支付
        1、支付渠道：非IOS端：VIP服务费用将在您点击购买之日按照收银台的标示价格通过支付宝、微信、花呗等第三方代收费以及各网银支付等方式等现有方式或今后大麦网指定方式，依约支付。
        2、支付完成后，不可进行转让和退款。除非因大麦网产品技术原因，导致您购买时被重复扣款或因大麦网产品技术原因导致您无法享有购买的服务时，您可提出退款申诉，经过大麦网核实后可为您办理退款，但您需要提供相应信息并配合大麦网处理。
        3、您明确了解并同意，本条第1款所约定的付费方式为代收费服务商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险（包括但不限于不法分子利用您账户或银行卡等进行违法活动），该等风险均会给您造成相应的经济损失。为此，您同意大麦网在充分履行其在本协议项下义务及勤勉谨慎义务的前提下不对您的前述风险和损失承担责任；并且，大麦网不承担向不法分子追究侵权责任或者代其向您承担损失的责任和义务。
        （五）其他VIP会员的权利及限制
        1、您在使用大麦网VIP会员服务过程中，应遵守宪法法律，包括但不限于《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》、《网络安全法》等有关计算机及互联网规定的法律、法规；应遵守公共秩序，尊重社会公德；不得危害网络安全；不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动；
        2、不得使用带有非法、淫秽、污辱或人身攻击的含义污辱或人身攻击的昵称、头像和签名档；
        3、不得损害第三方利益，通过大麦网收集第三方资料信息，破坏或盗取第三方账号，发送诈骗邮件和垃圾邮件等非法信息，侵犯第三方合法权益，包括但不限于隐私权、知识产权、财产权等；
        4、不得进行其他未经大麦网明示授权许可的行为；
        5、如大麦网VIP会员出现任何违反国家法律法规或监管政策的、违反本协议或大麦网相关使用规则的行为的，或大麦网认为VIP会员行为有损大麦网或/及其关联公司的声誉、利益的，大麦网有权决定单独或同时采取以下一项或多项措施进行处理：
        5.1 无需通知而中断或终止部分或全部VIP会员权益或服务、取消大麦网VIP会员账户和使用权限、取消使用非法获取的优惠券支付的订单，并不予任何赔偿或退还任何VIP会员服务费及票款；
        5.2 如VIP会员的违约行为使大麦网或/及其关联公司遭受损失的（包括但不限于直接经济损失、商誉损失及对外支付的赔偿金、和解费、律师费、诉讼费等间接经济损失），该VIP会员应当承担损失赔偿责任并在大麦网要求的时限内支付完毕。
        6、VIP会员在使用大麦网所提供的服务时，如遭受人身或财产的损失、损害或伤害，除法律规定的责任外，大麦网或/及其关联公司均不负责任。
        三、个人信息保护
        1、大麦网非常重视您个人信息的保护，在您使用大麦网提供的服务时，您同意大麦网按照在大麦网平台上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。大麦网希望通过隐私权政策向您清楚地介绍大麦网对您个人信息的处理方式，因此大麦网建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。
        详细个人信息政策请阅《大麦网会员服务协议》及《隐私权专项条款》。如您不同意请不要开通或停止使用本服务。
        2、您声明并保证，您需对您所发布的信息拥有相应、合法的权利，否则大麦网有权对您发布的信息依法或依本协议进行删除或屏蔽。
        3、为方便您使用“大麦网VIP会员”、“大麦网”（指www.damai.cn）、“淘宝平台”、支付宝等其他相关服务，您授权 “大麦网”将您在账户注册和使用“大麦网VIP会员”服务过程中提供、形成的信息传递给“淘宝平台”、支付宝等其他相关服务提供者，或从“淘宝平台”、支付宝等其他相关服务提供者获取您在注册、使用“淘宝平台”、支付宝服务期间提供、形成的信息。
        四、通知和送达
        对于大麦网VIP会员所有的通知均可通过大麦网网页公告、站内消息、客户端推送、公众号通知、会员预留的电子邮件、手机短信或常规的信件传送等方式进行，该等通知于发送之日视为已送达用户。请您应确保预留的联系方式为正确及有效，并在变更后及时登录大麦网修改，如因您未提供正确的联系信息或未及时告知新的联系方式，导致无法及时收取通知，将由您自行承担由此产生的损失及法律后果。
        五、服务的中止、终止及变更
        1、本服务的中止或终止包含如下情况：
        （1）您主动中止或终止，包括但不限于会员到期未进行续费等；
        （2）因为您的违约行为，大麦网主动中止或终止服务的；
        （3）因国家或相关政府监管部门要求或发生不可抗力事件时，大麦网中止或终止服务的；
        （4）其他根据法律法规应中止或终止服务的。
        2、中止或终止服务后，大麦网有权利但无需确保您收到特别提示或通知。当您发现无法登录或享受服务时，可以咨询大麦网客服人员。
        3、中止或终止后的处理
        （1）除法律规定的责任外，大麦网对本服务的中止或终止对您和第三人不承担任何责任；
        （2）已收取的费用不予退还；
        （3）在一定合理时间内保留相关订票数据信息，其他VIP会员权益将根据网站规定进行变更或减少；
        （4）在大麦网正在进行的交易，大麦网将根据情况合理判断，是否继续进行或终止相关交易，并视情况决定是否进行退费或扣除相关费用作为违约金。
        4、 您同意，由于互联网服务的特殊性，大麦网有权基于合法理由，修改、变更、中断或终止部分或全部服务，或变更、删除、转移用户存储、发布在大麦网的内容，统称“变更行为”。 大麦网保留采取前述变更行为而不需通知您的权利，且您同意，依本服务协议规定提供之本服务，无需进行事先通知即可变更、中断或终止。并且您同意，由于变更行为而造成的损失，大麦网无需对您对或第三人承担责任。
        六、未成年人条款
        1 、大麦网非常注重未成年人的保护。若用户未满18周岁，则为未成年人，应在其监护人监护、指导下阅读本协议和使用本VIP会员服务。
        2、 监护人应指导子女上网应该注意的安全问题，防患于未然。若监护人同意未成年人使用大麦网提供的本VIP会员服务，必须以监护人名义申请消费，并对未成年人使用本会员服务进行正确引导、监督。未成年人行使和履行本协议项下的权利和义务即视为已获得了监护人的认可。
        七、 协议有效期限、终止
        除本协议另有约定情况外，本协议自您选择接受或使用本服务后生效，直至您终止本服务/注销会员资格时终止。
        八、 争议解决和法律适用
        1、本协议条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，本协议条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。
        2、如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，任何一方均可向北京市东城区人民法院提起诉讼。
        九、其他
        1、本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
        2、大麦网有权不经您同意即将其在本协议项下的全部权利义务部分或整体转让给任何大麦网的关联公司，但保证该转让行为不会影响或损害您之前享有的权利。
      </div>
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    back() {
      this.$emit("s-back");
    }
  }
};
</script>

<style scoped lang="scss">
@import "../../../../public/scss/index.scss";
@import "../../../../public/scss/mixin.scss";

.agree {
  position: fixed;
  top: 0;
  left: 0;
  right: 0;
  bottom: 0;
  background-color: #fff;
  z-index: 20;
}

.header {
  padding: 0 0.3rem;
  height: 1rem;
  text-align: center;
  background: #fff;
  @include scale-border-bottom(rgba(7, 17, 27, 0.2));

  .close {
    display: inline-block;
    position: absolute;
    left: 0;
    top: 0;
    width: 1rem;
    height: 1rem;
    font-size: 0.4rem;
    line-height: 1rem;
    text-align: center;
  }

  .title {
    font-size: 0.42rem;
    vertical-align: middle;
    position: relative;
    top: -0.14rem;
  }
}

.container {
  position: fixed;
  top: 1rem;
  left: 0;
  right: 0;
  bottom: 0;
  padding: 0 0.3rem;
  overflow: auto;

  &::-webkit-scrollbar {
    display: none;
  }

  .content {
    padding: 0.3rem 0;
    font-size: 0.3rem;
    line-height: 0.46rem;
  }
}
</style>